performance/load-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 20
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      Authorization: 'Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VySWQiOiJmNDdhYzEwYi01OGNjLTQzNzItYTU2Ny0wZTAyYjJjM2Q0NzkiLCJlbWFpbCI6InRlc3RAZXhhbXBsZS5jb20iLCJyb2xlIjoidXNlciIsImlhdCI6MTcwNDEwMDAwMCwiZXhwIjoxNzA0MTg2NDAwfQ.test-token'
      Content-Type: 'application/json'
  processor: './performance/processor.js'

scenarios:
  - name: "Health Check"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: status

  - name: "Get Medications"
    weight: 30
    flow:
      - get:
          url: "/api/medications"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: success
          capture:
            - json: "$.data[0].id"
              as: "medicationId"

  - name: "Create Medication"
    weight: 20
    flow:
      - post:
          url: "/api/medications"
          json:
            name: "{{ $randomString() }} Medication"
            dosage: "{{ $randomInt(50, 500) }}mg"
            schedule: ["08:00", "20:00"]
          expect:
            - statusCode: 201
            - contentType: json
            - hasProperty: success
          capture:
            - json: "$.data.id"
              as: "newMedicationId"

  - name: "Get Specific Medication"
    weight: 15
    flow:
      - get:
          url: "/api/medications/{{ medicationId }}"
          expect:
            - statusCode: [200, 404]
            - contentType: json

  - name: "Update Medication"
    weight: 15
    flow:
      - put:
          url: "/api/medications/{{ medicationId }}"
          json:
            name: "Updated {{ $randomString() }}"
            dosage: "{{ $randomInt(100, 1000) }}mg"
          expect:
            - statusCode: [200, 404]
            - contentType: json

  - name: "Search Medications"
    weight: 10
    flow:
      - get:
          url: "/api/medications/search?q=aspirin"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: success